Revit 2024 API
ParameterTypeId.RebarShapeEndtreatmentEndType Property
 "End Treatment At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarShapeEndtreatmentEndType { get; }
Visual Basic
Public Shared ReadOnly Property RebarShapeEndtreatmentEndType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarShapeEndtreatmentEndType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace